// Дана строка 'aa aba abba abbba abbbba abbbbba'. 
// Напишите регулярку, которая найдет строки abba, abbba, abbbba и только их

console.log('aa aba abba abbba abbbba abbbbba'.replace(/ab{2,4}a/g, '!'));
// ---> aa aba ! ! ! abbbbba

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка 'aa aba abba abbba abbbba abbbbba'. 
// Напишите регулярку, которая найдет строки вида aba, 
// в которых 'b' встречается менее 3-х раз (включительно). 

console.log('aa aba abba abbba abbbba abbbbba'.replace(/ab{0,3}a/g, '!'));
// --->  ! ! ! ! abbbba abbbbba

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка 'aa aba abba abbba abbbba abbbbba'. 
// Напишите регулярку, которая найдет строки вида aba, 
// в которых 'b' встречается более 4-х раз (включительно)

console.log('aa aba abba abbba abbbba abbbbba'.replace(/ab{4,}a/g, '!'));
// --->  aa aba abba abbba ! !
