// Дана строка 'aAXa aeffa aGha aza ax23a a3sSa'. 
// Напишите регулярку, которая найдет строки следующего 
// вида: по краям стоят буквы 'a', а между ними - 
// маленькие латинские буквы, не затронув остальных.

console.log('aAXa aeffa aGha aza ax23a a3sSa'.replace(/a[a-z]+a/g, '!'));
// ---> aAXa ! aGha ! ax23a a3sSa

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка 'aAXa aeffa aGha aza ax23a a3sSa'. 
// Напишите регулярку, которая найдет строки следующего 
// вида: по краям стоят буквы 'a', а между ними - маленькие 
// и большие латинские буквы, не затронув остальных.

console.log('aAXa aeffa aGha aza ax23a a3sSa'.replace(/a[a-zA-Z]+a/g, '!'));
// ---> ! ! ! ! ax23a a3sSa

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

//Дана строка 'aAXa aeffa aGha aza ax23a a3sSa'. 
// Напишите регулярку, которая найдет строки следующего вида: 
// по краям стоят буквы 'a', а между ними - маленькие латинские буквы и цифры, 
// не затронув остальных

console.log('aAXa aeffa aGha aza ax23a a3sSa'.replace(/a[a-z0-9]+a/g, '!'));
// ---> aAXa ! aGha ! ! a3sSa

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка 'ааа ббб ёёё ззз ййй ААА БББ ЁЁЁ ЗЗЗ ЙЙЙ'. 
// Напишите регулярку, которая найдет все слова по шаблону: 
// любая кириллическая буква любое количество раз

console.log('ааа ббб ёёё ззз ййй ААА БББ ЁЁЁ ЗЗЗ ЙЙЙ'.replace(/[а-яА-ЯЁё]+/g, '!'));
// ---> ! ! ! ! ! ! ! ! ! !