// Проверьте формат номера кредитной карты
// Напишите программу для проверки номера кредитной карты.

console.log(/^(34|37)\d{13}$/.test('378282246300011')) // American Express
console.log(/^4(\d{12}|\d{15})$/g.test('4782822463100')) // Visa
console.log(/^(51|55)\d{14}$/g.test('5147828224631001')) // MasterCard
console.log(/^(6011\d{12}|5\d{14})$/g.test('6011828224631001')) // 
console.log(/^(30[0-5]\d{11}|36\d{12}|38\d{12})$/g.test('30578282246311')) // Diners Club
console.log(/^((2131|1800)\d{11}|35\d{14})$/g.test('213178282246311')) // JCB
