// С помощью позитивного и негативного просмотра найдите 
// все строки по шаблону 3 буквы a, затем буква b и 
// поменяйте 3 буквы a на знак '!'. То есть из 'aaab' нужно сделать '!b'.

console.log('aaab'.replace(/aaa(?=b)/g, '!'))
// ---> !b

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
// С помощью позитивного и негативного просмотра найдите 
// все строки по шаблону 3 буквы a, затем любая буква, 
// но не b и поменяйте 3 буквы a на знак '!'. 
// То есть из, к примеру, 'aaaw' нужно сделать '!w', а 'aaab' не поменяется. 

console.log('aaaw aaab'.replace(/aaa(?!b)/g, '!'))
// ---> !w aaab
