// Определите, что год находится в интервале от 1900 до 2100 с
// помощью одного только регулярного выражения

console.log(/^(19\d\d|20\d\d|2100)$/.test('2000'));
// ---> true

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// С помощью test определите, что переданная строка является 
// корректным временем вида '12:59', '23:41', '00:12', 
// '00:00', '09:15'. Время '24.00', '25.00', '12.60', '12.93', '41.93' 
// является некорректным.

console.log(/^([01]\d|2[0-3]):[0-5]\d$/.test('12:59'));
// ---> true

console.log(/^([01]\d|2[0-3]):[0-5]\d$/.test('23:41'));
// ---> true

console.log(/^([01]\d|2[0-3]):[0-5]\d$/.test('00:12'));
// ---> true

console.log(/^([01]\d|2[0-3]):[0-5]\d$/.test('00:00'));
// ---> true

console.log(/^([01]\d|2[0-3]):[0-5]\d$/.test('09:15'));
// ---> true

console.log('==============================');

console.log(/^([01]\d|2[0-3]):[0-5]\d$/.test('24.00'));
// ---> false

console.log(/^([01]\d|2[0-3]):[0-5]\d$/.test('25.00'));
// ---> false

console.log(/^([01]\d|2[0-3]):[0-5]\d$/.test('12.60'));
// ---> false

console.log(/^([01]\d|2[0-3]):[0-5]\d$/.test('12.93'));
// ---> false

console.log(/^([01]\d|2[0-3]):[0-5]\d$/.test('41.93'));
// ---> false

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// // С помощью test определите, что переданная строка является 
// // корректным временем вида '9.59 am', '12.30 pm'

// console.log(/^([01]\d|2[0-3])\.[0-5]\d\s[ap]m$/.test('9.59 am'));
// // ---> false

// console.log(/^([01]\d|2[0-3])\.[0-5]\d\s[ap]m$/.test('12.30 pm'));
// // ---> true

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// // Удалите одной регуляркой все слова из предложения, 
// // содержащие две одинаковые следующие друг за другом буквы. 

// console.log("aaa zzqzqaq hsdds".replace(/\W*\w*(\w)\1\w*\W*/g, " "));
// // ---> false

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Удалите одной регуляркой все повторяющиеся слова из строки, 
// например для 'dsf xxx xxx sd' должно вернуть 'dsf xxx sd'.

console.log('dsf xxx xxx sd'.replace(/\b(\w+)\s+\1/g, "$1"));
// ---> dsf xxx sd

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Решите предыдущую задачу с учетом того, что слово может повторяться
// много раз. Например 'dsf xxx xxx xxx xxx xxx sd' 
// должно вернуть 'dsf xxx sd'.

console.log('dsf xxx xxx xxx xxx xxx sd'.replace(/\b(\w+)\b(?:\s+\1\b)+/g, "$1"));
// ---> dsf xxx sd
