// Дана строка 'aaa@bbb eee7@kkk'. 
// Напишите регулярку, которая найдет строки по шаблону: 
// любое количество букв и цифр, символ @, любое количество 
// букв и цифр и поменяет местами то, что стоит до @ на то, 
// что стоит после нее. Например, aaa@bbb должно превратиться в bbb@aaa.

console.log('aaa@bbb eee7@kkk'.replace(/([a-z0-9]+)@([a-z0-9]+)/g, '$2@$1'))
// ---> bbb@aaa kkk@eee7

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка вида 'a1b2c3'. 
// Напишите регулярку, которая 
// найдет все цифры и удвоит их количество таким образом: 
// 'a11b22c33' (то есть рядом с каждой цифрой напишет такую же)

console.log('a1b2c3'.replace(/([0-9]+)/g, '$1$1'))
// ---> a11b22c33


