// С помощью метода test определите, что переданная
// строка является емэйлом. Примеры емэйлов для тестирования
// mymail@mail.ru, my.mail@mail.ru, my-mail@mail.ru, my_mail@mail.ru,
// mail@mail.com, mail@mail.by, mail@yandex.ru.

console.log(/^[a-zA-Z-.]+@[a-z]+\.[a-z]{2,3}$/.test('mymail@mail.ru'));
// ---> true

console.log(/^[a-zA-Z-.]+@[a-z]+\.[a-z]{2,3}$/.test('my.mail@mail.ru'));
// ---> true

console.log(/^[a-zA-Z-.]+@[a-z]+\.[a-z]{2,3}$/.test('my-mail@mail.ru'));
// ---> true

console.log(/^[a-zA-Z-.]+@[a-z]+\.[a-z]{2,3}$/.test('my_mail@mail.ru'));
// ---> false

console.log(/^[a-zA-Z-.]+@[a-z]+\.[a-z]{2,3}$/.test('mail@mail.com'));
// ---> true

console.log(/^[a-zA-Z-.]+@[a-z]+\.[a-z]{2,3}$/.test('mail@mail.by'));
// ---> true

console.log(/^[a-zA-Z-.]+@[a-z]+\.[a-z]{2,3}$/.test('mail@yandex.ru'));
// ---> true

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка с текстом, в котором могут быть емейлы.
// С помощью match найдите все емэйлы в виде массива.

console.log(
  'mymail@mail.ru my.mail@mail.ru my-mail@mail.ru my_mail@mail.ru mail@mail.com mail@mail.by mail@yandex.ru'.match(
    /[a-zA-Z-.]+@[a-z]+\.[a-z]{2,3}/g
  )
);
// ---> [
//   'mymail@mail.ru',
//   'my.mail@mail.ru',
//   'my-mail@mail.ru',
//   'mail@mail.ru',
//   'mail@mail.com',
//   'mail@mail.by',
//   'mail@yandex.ru'
// ]

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// С помощью test определите,
// что переданная строка является доменом.
// Примеры доменов: site.ru, site.com, my-site.com.

console.log(/^[a-zA-Z-.]+\.[a-z]{2,3}$/.test('site.ru'));
// ---> true

console.log(/^[a-zA-Z-.]+\.[a-z]{2,3}$/.test('site.com'));
// ---> true

console.log(/^[a-zA-Z-.]+\.[a-z]{2,3}$/.test('my-site.com'));
// ---> true

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// С помощью test определите,
// что переданная строка является доменом.
// Примеры доменов: http://site.ru, http://site.com

console.log(/^http:\/\/[a-z-._]+\.[a-z]{2,3}$/.test('http://site.ru'));
// ---> true

console.log(/^http:\/\/[a-z-._]+\.[a-z]{2,3}$/.test('http://site.com'));
// ---> true

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// С помощью test определите, что переданная строка
// является доменом вида http://site.ru.
// Протокол может быть как http, так и https

console.log(/^https?:\/\/[a-z-._]+\.[a-z]{2,3}$/.test('http://site.ru'));
// ---> true

console.log(/^https?:\/\/[a-z-._]+\.[a-z]{2,3}$/.test('https://site.ru'));
// ---> true

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// С помощью test определите, что переданная строка
// начинается с http или с https.

console.log(/^https?/.test('http://site.ru'));
// ---> true

console.log(/^https?/.test('https://site.ru'));
// ---> true

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// С помощью test определите, что переданная
// строка заканчивается расширением txt, html или php

console.log(/\.(txt|html|php)$/.test('file.txt'));
// ---> true

console.log(/\.(txt|html|php)$/.test('file.html'));
// ---> true

console.log(/\.(txt|html|php)$/.test('file.php'));
// ---> true

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// С помощью test определите, что переданная
// строка заканчивается расширением jpg или jpeg.

console.log(/\.(jpg|jpeg)$/.test('file.jpg'));
// ---> true

console.log(/\.(jpg|jpeg)$/.test('file.jpeg'));
// ---> true

console.log(/\.jpe?g$/.test('file.jpeg'));
// ---> true

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// С помощью test узнайте является ли строка числом,
// длиной до 12 цифр.

console.log(/^\d{12}$/.test('123456789101'));
// ---> true

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка с буквами, пробелами и цифрами.
// Найдите сумму всех чисел из данной строки.

const str = '12f321fc432'.match(/\d/g);

console.log(str.reduce((prev, next) => +prev + +next));
