// Дана строка 'ahb acb aeb aeeb adcb axeb'.
// Напишите регулярку, которая найдет строки ahb, acb, aeb по шаблону:
// буква 'a', любой символ, буква 'b'.

console.log('ahb acb aeb aeeb adcb axeb'.replace(/a.b/g, '!'));
// ---> ! ! ! aeeb adcb axeb

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка 'aba aca aea abba adca abea'.
// Напишите регулярку, которая найдет строки
// abba adca abea по шаблону: буква 'a',
// 2 любых символа, буква 'a'.

console.log('aba aca aea abba adca abea'.replace(/a..a/g, '!'));
// ---> aba aca aea ! ! !

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка 'aba aca aea abba adca abea'. 
// Напишите регулярку, которая найдет строки abba и abea, 
// не захватив adca

console.log('aba aca aea abba adca abea'.replace(/ab.a/g, '!'));
// ---> aba aca aea ! adca !