// Дана строка 'aa aba abba abbba abca abea'. 
// Напишите регулярку, которая найдет строки aba, abba, abbba по шаблону:
// буква 'a', буква 'b' любое количество раз, буква 'a'.

console.log('aa aba abba abbba abca abea'.replace(/ab+a/g, '!'));
// ---> aa ! ! ! abca abea

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка 'aa aba abba abbba abca abea'. 
// Напишите регулярку, которая найдет строки aa, aba, abba, abbba по шаблону:
// буква 'a', буква 'b' любое количество раз (в том числе ниодного раза), буква 'a'.


console.log('aa aba abba abbba abca abea'.replace(/ab*a/g, '!'));
// ---> ! ! ! ! abca abea

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

//Дана строка 'aa aba abba abbba abca abea'. 
// Напишите регулярку, которая найдет строки aa, aba по шаблону:
// буква 'a', буква 'b' один раз или ниодного, буква 'a'.

console.log('aa aba abba abbba abca abea'.replace(/ab?a/g, '!'));
// ---> ! ! abba abbba abca abea

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка 'aa aba abba abbba abca abea'. 
// Напишите регулярку, которая найдет строки aa, aba, abba, abbba, 
// не захватив abca abea

console.log('aa aba abba abbba abca abea'.replace(/ab*a/g, '!'));
// ---> ! ! ! ! abca abea

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////

// Дана строка 'ab abab abab abababab abea'. 
// Напишите регулярку, которая найдет строки по шаблону: 
// строка 'ab' повторяется 1 или более раз.

console.log('ab abab abab abababab abea'.replace(/(ab)+/g, '!'));
// ---> ! ! ! ! !ea
